{"class_name": "Functional", "config": {"name": "encoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 9, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [1, 9, 8, 1]}, "name": "tf.__operators__.getitem", "inbound_nodes": [["input_1", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 8, "step": null}]}]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "input_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 8, 8, 1]}, "name": "input_quantization", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}, {"module": "qkeras.qconvolutional", "class_name": "QConv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QConv2D", "build_config": {"input_shape": [1, 8, 8, 1]}, "name": "conv2d", "inbound_nodes": [[["input_quantization", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "act", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 4, 4, 8]}, "name": "act", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [1, 4, 4, 8]}, "name": "flatten", "inbound_nodes": [[["act", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [1, 9, 8, 1]}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["input_1", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, 8]}]]}, {"module": "qkeras.qlayers", "class_name": "QDense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QDense", "build_config": {"input_shape": [1, 128]}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 8, 1]}, "name": "tf.compat.v1.squeeze", "inbound_nodes": [["tf.__operators__.getitem_1", 0, 0, {"axis": null, "name": null}]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "latent_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 9, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 16]}, "name": "latent_quantization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [8]}, "name": "tf.expand_dims", "inbound_nodes": [["tf.compat.v1.squeeze", 0, 0, {"axis": 0}]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 1}, "registered_name": null, "build_config": {"input_shape": [[1, 16], [1, 8]]}, "name": "concatenate", "inbound_nodes": [[["latent_quantization", 0, 0, {}], ["tf.expand_dims", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["concatenate", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}