{"class_name": "Functional", "config": {"name": "cae", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Wafer"}, "registered_name": null, "name": "Wafer", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "Cond"}, "registered_name": null, "name": "Cond", "inbound_nodes": []}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "encoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Wafer"}, "registered_name": null, "name": "Wafer", "inbound_nodes": []}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "input_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [4000, 8, 8, 1]}, "name": "input_quantization", "inbound_nodes": [[["Wafer", 0, 0, {}]]]}, {"module": null, "class_name": "keras_pad", "config": {"name": "keras_pad_4", "trainable": true, "dtype": "float32"}, "registered_name": "keras_pad", "build_config": {"input_shape": [4000, 8, 8, 1]}, "name": "keras_pad_4", "inbound_nodes": [[["input_quantization", 0, 0, {}]]]}, {"module": "qkeras.qconvolutional", "class_name": "QConv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QConv2D", "build_config": {"input_shape": [4000, 9, 9, 1]}, "name": "conv2d", "inbound_nodes": [[["keras_pad_4", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "act", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [4000, 4, 4, 8]}, "name": "act", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [4000, 4, 4, 8]}, "name": "flatten_4", "inbound_nodes": [[["act", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QDense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QDense", "build_config": {"input_shape": [4000, 128]}, "name": "dense", "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "latent_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 9, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [4000, 16]}, "name": "latent_quantization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_4", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [4000, 16]}, "name": "tf.math.multiply_4", "inbound_nodes": [["latent_quantization", 0, 0, {"y": 256, "name": null}]]}, {"module": null, "class_name": "keras_floor", "config": {"name": "keras_floor_4", "trainable": true, "dtype": "float32"}, "registered_name": "keras_floor", "build_config": {"input_shape": [4000, 16]}, "name": "keras_floor_4", "inbound_nodes": [[["tf.math.multiply_4", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.truediv_4", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [4000, 16]}, "name": "tf.math.truediv_4", "inbound_nodes": [["keras_floor_4", 0, 0, {"y": 256, "name": null}]]}, {"module": null, "class_name": "keras_minimum", "config": {"name": "keras_minimum_4", "trainable": true, "dtype": "float32"}, "registered_name": "keras_minimum", "build_config": {"input_shape": [4000, 16]}, "name": "keras_minimum_4", "inbound_nodes": [[["tf.math.truediv_4", 0, 0, {"sat_val": 1.99609375}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "Cond"}, "registered_name": null, "name": "Cond", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": 1}, "registered_name": null, "build_config": {"input_shape": [[4000, 16], [4000, 8]]}, "name": "concatenate_4", "inbound_nodes": [[["keras_minimum_4", 0, 0, {}], ["Cond", 0, 0, {}]]]}], "input_layers": [["Wafer", 0, 0], ["Cond", 0, 0]], "output_layers": [["concatenate_4", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [[4000, 8, 8, 1], [4000, 8]]}, "name": "encoder", "inbound_nodes": [[["Wafer", 0, 0, {}], ["Cond", 0, 0, {}]]]}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "decoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "registered_name": null, "name": "input_5", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_12", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "re_lu_16", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_13", "inbound_nodes": [[["re_lu_16", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "re_lu_17", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "dense_14", "inbound_nodes": [[["re_lu_17", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "re_lu_18", "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 8]}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "reshape_4", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [4000, 4, 4, 8]}, "name": "conv2d_transpose_4", "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_4", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [4000, 9, 9, 1]}, "name": "tf.__operators__.getitem_4", "inbound_nodes": [["conv2d_transpose_4", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 8, "step": null}, {"start": 0, "stop": 8, "step": null}]}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_19", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 8, 8, 1]}, "name": "re_lu_19", "inbound_nodes": [[["tf.__operators__.getitem_4", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["re_lu_19", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [4000, 24]}, "name": "decoder", "inbound_nodes": [[["encoder", 1, 0, {}]]]}], "input_layers": [["Wafer", 0, 0], ["Cond", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}